app/controllers/articles_controller.rb

def index
	@article = Article.all
---
SELECT "articles".* FROM "articles"

def update
	@article = Article.find(params[:id])
	if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "this is another article hvjhv"], ["updated_at", "2016-01-30 05:42:31.562675"], ["id", 11]]

def create
     @article = Article.new(article_params)
      if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hie this is another test"], ["description", "checingn destription ojt the create"], ["created_at", "2016-01-30 04:21:13.429085"], ["updated_at", "2016-01-30 04:21:13.429085"]]